/* 
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
*/
string[] array = new string[] { "1", "234", "floor", "cat", "2", "45", "777", "hello" };
string[] newArray = new string[array.Length];
GetAndFillNewArray(array, newArray);
PrintNewArray(newArray);

void GetAndFillNewArray(string[] array, string[] newArray)
{
    int index = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            newArray[index] = array[i];
            index++;
        }
    }
}

void PrintNewArray(string[] col)
{
    int count = col.Length;
    int position = 0;
    while (position < count)
    {
        Console.Write(col[position] + " ");
        position++;
    }
}